eisup_2019_docmng_integration/src/Catalogs/абс_ТиповыеРоли/абс_ТиповыеРоли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ТиповыеРоли</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеЗаданноеВКонфигураторе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольИСУЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/абс_ТиповыеРоли/Forms/Форма/Module.bsl
&НаСервере
Процедура ПолучитьТаблицуНеДобавленныхРолей(ТекущийНаборРолей)
	Для Каждого Роль Из Метаданные.Роли Цикл
		СпрТиповаяРоль = Справочники.абс_ТиповыеРоли.НайтиПоРеквизиту("НаименованиеЗаданноеВКонфигураторе",СокрЛП(Роль.Имя));
		
		Если СпрТиповаяРоль = Справочники.абс_ТиповыеРоли.ПустаяСсылка() Тогда
			НоваяСтрока = ТекущийНаборРолей.Добавить();
			НоваяСтрока.Роль                = Роль.Синоним;
			НоваяСтрока.РольКонфигуратор    = Роль.Имя;
			НоваяСтрока.РольИСУЗК    		= Ложь;
			НоваяСтрока.Пометка		        = Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	Макет = Справочники.абс_ТиповыеРоли.ПолучитьМакет("РолиИСУЗК");
	
	Для Каждого Область Из Макет.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда
			
			ВерхОбласти = Область.Верх;
			НизОбласти = Область.Низ;
			Для НомСтр = ВерхОбласти По НизОбласти Цикл
				ИмяРолиВКонфигураторе = СокрП(Макет.Область(НомСтр, 1).Текст);
				
				СпрТиповаяРоль = Справочники.абс_ТиповыеРоли.НайтиПоРеквизиту("НаименованиеЗаданноеВКонфигураторе",СокрЛП(ИмяРолиВКонфигураторе));

				Если СпрТиповаяРоль = Справочники.абс_ТиповыеРоли.ПустаяСсылка() Тогда
					НоваяСтрока = ТекущийНаборРолей.Добавить();
					НоваяСтрока.Роль                = СокрП(Макет.Область(НомСтр, 2).Текст);
					НоваяСтрока.РольКонфигуратор    = ИмяРолиВКонфигураторе;
					НоваяСтрока.РольИСУЗК    		= Истина;
					НоваяСтрока.Пометка		        = Истина;
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	
	//АБС добавление ролей ИСУЗК
	//Выборка = Справочники.РолиИсполнителей.Выбрать(Справочники.РолиИсполнителей.РолиИСУЗК);
	//Пока Выборка.Следующий() Цикл
	//СпрТиповаяРоль = Справочники.абс_ТиповыеРоли.НайтиПоРеквизиту("НаименованиеЗаданноеВКонфигураторе",Справочники.РолиИсполнителей.ПолучитьИмяПредопределенного(Выборка.Ссылка));
	//  
	//	Если СпрТиповаяРоль = Справочники.абс_ТиповыеРоли.ПустаяСсылка() Тогда
	//		НоваяСтрока = ТекущийНаборРолей.Добавить();
	//		НоваяСтрока.Роль                = Выборка.Ссылка.наименование;
	//		НоваяСтрока.РольКонфигуратор    = Справочники.РолиИсполнителей.ПолучитьИмяПредопределенного(Выборка.Ссылка);
	//		НоваяСтрока.РольИСУЗК    		= Истина;
	//		НоваяСтрока.Пометка		        = Истина;
	//	КонецЕсли; 
	//КонецЦикла;
	
	//АБС добавление ролей ИСУЗК

КонецПроцедуры

&НаСервере
Процедура СохранитьРолиНаСервере()
	Для каждого Стр Из ТаблицаРолей Цикл
		Если Стр.Пометка Тогда	
			НовыйЭлемент = Справочники.абс_ТиповыеРоли.СоздатьЭлемент();
			НовыйЭлемент.Наименование = Стр.Роль;
			НовыйЭлемент.НаименованиеЗаданноеВКонфигураторе = Стр.РольКонфигуратор;
			НовыйЭлемент.Активна = Стр.Пометка;
			//АБС добавление ролей ИСУЗК
			НовыйЭлемент.РольИСУЗК = Стр.РольИСУЗК;
			//АБС добавление ролей ИСУЗК			
			НовыйЭлемент.Записать();
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьРоли(Команда)
	СохранитьРолиНаСервере();	
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийНаборРолей = РеквизитФормыВЗначение("ТаблицаРолей");
	ПолучитьТаблицуНеДобавленныхРолей(ТекущийНаборРолей);	
	ЗначениеВРеквизитФормы(ТекущийНаборРолей,"ТаблицаРолей");
КонецПроцедуры

&НаКлиенте
Процедура Инвертировать(Команда)
	Для каждого Стр Из ТаблицаРолей Цикл
		Стр.Пометка = Не Стр.Пометка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для каждого Стр Из ТаблицаРолей Цикл
		Стр.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для каждого Стр Из ТаблицаРолей Цикл
		Стр.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры
